# PANDAS - DAY 3 ( TIPS AND TRICKS )

## Table of Contents:

[1. how-to-find-the-version](#01--how-to-find-the-version)\
[2. making-a-data-frame](#02--making-a-data-frame)\
[3. using-numpy-to-create-dataframe](#3--using-numpy-to-create-dataframe)\
[4. sing-template-data](#4-using-template-data)\
[5. using-your-own-data](#5-using-your-own-data)\
[6. reverse-row-order](#6-reverse-row-order)\
[7. reverse-colun-order](#7--reverse-colun-order)\
[8. select-a-cloumn-by-a-data-type](#8--select-a-cloumn-by-a-data-type)\
[9. convert-numbers-into-strings](#9--convert-numbers-into-strings)\
[10. reduce-dataframe-size](#10--reduce-dataframe-size)\
[11. copy-data-from-clipboard](#11--copy-data-from-clipboard)

### 01 . How to find the version?

In [2]:
import pandas as pd

In [3]:
pd.__version__

'1.5.3'

In [4]:
pd.show_versions()

c:\Users\Administrator\AppData\Local\Programs\Python\Python311\Lib\site-packages\_distutils_hack\__init__.py:33: UserWarning: Setuptools is replacing distutils.
  warnings.warn("Setuptools is replacing distutils.")

INSTALLED VERSIONS
------------------
commit           : 2e218d10984e9919f0296931d92ea851c6a6faf5
python           : 3.11.1.final.0
python-bits      : 64
OS               : Windows
OS-release       : 10
Version          : 10.0.22000
machine          : AMD64
processor        : Intel64 Family 6 Model 78 Stepping 3, GenuineIntel
byteorder        : little
LC_ALL           : None
LANG             : None
LOCALE           : English_United States.1252

pandas           : 1.5.3
numpy            : 1.24.2
pytz             : 2022.7.1
dateutil         : 2.8.2
setuptools       : 65.5.0
pip              : 23.1.2
Cython           : None
pytest           : None
hypothesis       : None
sphinx           : None
blosc            : None
feather          : None
xlsxwriter       : None
lxml.etree       : None
html5lib         : None
pymysql          : None
psycopg2         : None
jinja2           : 3.1.2
IPython          : 8.13.2
pandas_datareader: None
bs4              : 4.11.2
bottleneck       : None
brotli           : None
fastparquet      : None
fsspec           : None
gcsfs            : None
matplotlib       : 3.7.1
numba            : None
numexpr          : None
odfpy            : None
openpyxl         : 3.1.2
pandas_gbq       : None
pyarrow          : None
pyreadstat       : None
pyxlsb           : None
s3fs             : None
scipy            : None
snappy           : None
sqlalchemy       : None
tables           : None
tabulate         : None
xarray           : None
xlrd             : None
xlwt             : None
zstandard        : None
tzdata           : None

### 02- Making a Data Frame

In [5]:
df=pd.DataFrame({'Name ':["Uzair","Abbas","Lahad","Razi","Bilal"],'Age ': [20,19,21,22,19]})

In [6]:
df

   Name   Age
0  Uzair    20
1  Abbas    19
2  Lahad    21
3   Razi    22
4  Bilal    19

In [7]:
df.head()

   Name   Age
0  Uzair    20
1  Abbas    19
2  Lahad    21
3   Razi    22
4  Bilal    19

In [8]:
df.tail()

   Name   Age
0  Uzair    20
1  Abbas    19
2  Lahad    21
3   Razi    22
4  Bilal    19

In [9]:
df

   Name   Age
0  Uzair    20
1  Abbas    19
2  Lahad    21
3   Razi    22
4  Bilal    19

# 3- using numpy to create dataframe

In [10]:
# numpy array to create dataframe
import numpy as np
arr=np.array([['Uzair',20],['Abbas',19],['Lahad',21],['Razi',22],['Bilal',19]])
# arr
df=pd.DataFrame(arr,columns=['Name','Age'])
df

    Name Age
0  Uzair  20
1  Abbas  19
2  Lahad  21
3   Razi  22
4  Bilal  19

In [11]:
# numpy array data frame
pd.DataFrame(np.random.rand(5,2))
pd.DataFrame(np.random.rand(5,2), columns=list("AB"))

          A         B
0  0.713635  0.984922
1  0.229362  0.925105
2  0.353764  0.261917
3  0.786743  0.654151
4  0.599103  0.444780

In [12]:
pd.DataFrame(np.random.rand(50,20))

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19
0,0.082640,0.482650,0.262572,0.630917,0.650996,0.487077,0.897559,0.097623,0.897100,0.384376,0.080046,0.806807,0.791167,0.780029,0.993261,0.671865,0.033995,0.783380,0.135624,0.942277
1,0.170033,0.291670,0.234180,0.343212,0.314562,0.736114,0.199226,0.567784,0.606162,0.600972,0.100022,0.603227,0.880320,0.042338,0.710136,0.788393,0.771010,0.991539,0.660321,0.522473
2,0.706851,0.414883,0.887200,0.979408,0.346596,0.631007,0.461310,0.248002,0.788451,0.124692,0.444774,0.557627,0.195415,0.278923,0.127454,0.242768,0.190109,0.280374,0.827345,0.520856
3,0.226471,0.746360,0.244478,0.231868,0.535484,0.115786,0.608427,0.183591,0.652091,0.114151,0.384096,0.360193,0.782123,0.695599,0.313812,0.658178,0.986702,0.690176,0.287778,0.080304
4,0.999015,0.193534,0.662584,0.902055,0.748963,0.795000,0.841456,0.187734,0.699634,0.439132,0.694864,0.234553,0.131515,0.701524,0.886895,0.856942,0.202656,0.573416,0.291751,0.060795
5,0.365616,0.857634,0.034942,0.859158,0.526352,0.180633,0.268409,0.170594,0.359641,0.449404,0.499046,0.625120,0.594843,0.652149,0.729086,0.897170,0.266692,0.667816,0.887349,0.053017
6,0.076577,0.695290,0.212470,0.997770,0.718721,0.508625,0.412172,0.886029,0.251760,0.639942,0.568156,0.207603,0.482319,0.080630,0.361462,0.826871,0.486003,0.788335,0.589537,0.249210
7,0.638163,0.845146,0.303026,0.810629,0.300904,0.525467,0.240926,0.498713,0.730846,0.916908,0.895773,0.618764,0.957288,0.714239,0.209420,0.572240,0.161918,0.764708,0.017301,0.682591
8,0.364931,0.407094,0.669868,0.626900,0.124335,0.841627,0.823676,0.756333,0.342079,0.628401,0.791619,0.990523,0.844625,0.378877,0.063187,0.961991,0.369391,0.316486,0.803673,0.744604
9,0.929792,0.114662,0.649745,0.863313,0.494926,0.830826,0.478364,0.145588,0.172781,0.675840,0.383476,0.529491,0.087858,0.682508,0.292121,0.008648,0.156031,0.810301,0.210072,0.918550
10,0.683504,0.727642,0.097847,0.272755,0.180065,0.576113,0.912464,0.629972,0.590355,0.828143,0.950321,0.716219,0.562739,0.189628,0.520014,0.675105,0.322750,0.855689,0.195663,0.038308
11,0.680624,0.921251,0.331020,0.906418,0.710738,0.172531,0.125056,0.093991,0.277773,0.366989,0.397785,0.434112,0.820582,0.063847,0.341948,0.541058,0.456674,0.497827,0.084233,0.546690
12,0.918930,0.768376,0.204300,0.118212,0.118957,0.255294,0.557852,0.065438,0.822424,0.604856,0.834359,0.904850,0.020130,0.348632,0.032645,0.884164,0.351633,0.842830,0.703540,0.052365
13,0.385382,0.636410,0.050290,0.282786,0.031782,0.449561,0.693721,0.131210,0.472433,0.354058,0.421436,0.497865,0.724175,0.400472,0.016673,0.621226,0.647687,0.531420,0.199317,0.829469
14,0.325866,0.624296,0.850418,0.012447,0.144148,0.480297,0.256766,0.091292,0.587896,0.422469,0.100900,0.535741,0.518638,0.627735,0.453341,0.378281,0.112535,0.769279,0.896477,0.614063
15,0.326975,0.451427,0.320219,0.831929,0.052656,0.403564,0.050009,0.702606,0.469772,0.399970,0.892097,0.314718,0.780323,0.536226,0.494468,0.533778,0.929904,0.315159,0.210940,0.104372
16,0.921628,0.078854,0.155170,0.012894,0.797517,0.535457,0.518163,0.673795,0.896643,0.319724,0.241196,0.192078,0.888421,0.120657,0.547127,0.197781,0.793840,0.528591,0.151382,0.068706
17,0.678603,0.555115,0.217818,0.488803,0.136303,0.576582,0.601845,0.420084,0.899458,0.647698,0.171059,0.251718,0.108595,0.704159,0.437351,0.527613,0.311594,0.203895,0.776527,0.460473
18,0.883943,0.455463,0.381145,0.505889,0.741918,0.526079,0.341121,0.947227,0.173839,0.402254,0.292846,0.691593,0.922823,0.114414,0.948953,0.011454,0.818162,0.454860,0.086805,0.348642
19,0.810597,0.527442,0.150404,0.900518,0.378913,0.159465,0.696352,0.545862,0.934656,0.056469,0.080884,0.123488,0.080635,0.239237,0.705320,0.647957,0.188780,0.204967,0.058744,0.153433
20,0.917637,0.781310,0.581525,0.645915,0.821564,0.191988,0.488658,0.651971,0.065451,0.858851,0.674012,0.591929,0.378161,0.295193,0.694391,0.630311,0.155129,0.120138,0.842438,0.974903
21,0.866506,0.393355,0.658647,0.865289,0.610411,0.207932,0.080124,0.016351,0.262897,0.033815,0.412450,0.846269,0.982154,0.055924,0.850125,0.989247,0.432017,0.392987,0.622654,0.745530
22,0.090468,0.365845,0.233750,0.604386,0.135016,0.811114,0.313571,0.709170,0.739541,0.194072,0.920395,0.657863,0.101977,0.184304,0.069525,0.442701,0.596637,0.633728,0.801968,0.138710
23,0.893002,0.520570,0.060137,0.049103,0.290191,0.823585,0.442181,0.101616,0.744117,0.690819,0.073811,0.517073,0.550940,0.761574,0.371857,0.262921,0.637311,0.380637,0.916871,0.184723
24,0.620361,0.789663,0.805378,0.216184,0.499646,0.455030,0.650737,0.140853,0.186290,0.529368,0.256441,0.872376,0.573004,0.713765,0.909878,0.595959,0.740690,0.539353,0.292236,0.530785
25,0.011075,0.522858,0.399815,0.542167,0.215065,0.421429,0.198327,0.047155,0.174556,0.743825,0.594759,0.267780,0.731362,0.775720,0.518478,0.107534,0.155745,0.694752,0.085889,0.274787
26,0.978541,0.161374,0.763515,0.017319,0.567317,0.346861,0.838575,0.403333,0.117921,0.681403,0.372084,0.545726,0.408354,0.864952,0.788671,0.251271,0.588137,0.711800,0.018505,0.649149
27,0.040325,0.898534,0.563272,0.616706,0.986379,0.563080,0.037725,0.396690,0.815149,0.025732,0.030373,0.843378,0.110662,0.457213,0.843225,0.097464,0.808170,0.236703,0.526804,0.517523
28,0.081155,0.169692,0.301102,0.516640,0.735252,0.577014,0.285203,0.712998,0.163786,0.716733,0.446399,0.224358,0.999586,0.639084,0.202327,0.291778,0.299045,0.824812,0.650195,0.853446
29,0.869397,0.472310,0.838826,0.650622,0.966066,0.958451,0.715997,0.076182,0.080130,0.047643,0.716822,0.617145,0.402607,0.242010,0.643684,0.574726,0.496009,0.807842,0.219398,0.485659
30,0.946278,0.072485,0.526035,0.836261,0.117213,0.162062,0.871999,0.001727,0.123293,0.313916,0.554918,0.933048,0.582116,0.271290,0.277696,0.449753,0.012133,0.453103,0.349570,0.009518
31,0.429689,0.351343,0.920955,0.139436,0.880989,0.501306,0.104112,0.982272,0.486797,0.723897,0.810090,0.591515,0.742749,0.989547,0.389696,0.686503,0.462149,0.315997,0.864753,0.850525
32,0.206169,0.968791,0.581085,0.173626,0.550867,0.721765,0.076736,0.155788,0.340955,0.723791,0.707457,0.512115,0.765513,0.194905,0.202851,0.051382,0.875264,0.341791,0.617421,0.964765
33,0.162804,0.434899,0.225080,0.972745,0.231281,0.809417,0.700949,0.657529,0.753975,0.462689,0.739498,0.366314,0.512009,0.889026,0.429541,0.356553,0.338068,0.394377,0.662944,0.196153
34,0.502435,0.147096,0.214148,0.083363,0.873923,0.631581,0.874728,0.555865,0.934979,0.086850,0.791237,0.683011,0.779731,0.517299,0.181156,0.224903,0.186330,0.022106,0.630476,0.842883
35,0.590827,0.716812,0.493652,0.808813,0.529825,0.033236,0.157696,0.621293,0.257572,0.927798,0.672179,0.193010,0.645085,0.561963,0.260094,0.177973,0.539591,0.575559,0.378503,0.233200
36,0.986458,0.333754,0.477489,0.572459,0.010258,0.204019,0.567606,0.253263,0.949923,0.386132,0.240182,0.329160,0.106705,0.030204,0.236925,0.229996,0.934842,0.166303,0.763922,0.491513
37,0.423766,0.907017,0.856057,0.749216,0.131479,0.272039,0.305154,0.333985,0.639076,0.837016,0.481120,0.527334,0.997910,0.756953,0.093908,0.402180,0.214585,0.292653,0.918447,0.623988
38,0.681823,0.063756,0.783640,0.819566,0.440358,0.714680,0.140648,0.138815,0.326255,0.119140,0.324805,0.860286,0.761555,0.009870,0.139350,0.814290,0.736621,0.045591,0.080785,0.662833
39,0.615619,0.771399,0.181196,0.140443,0.159840,0.370941,0.095953,0.711066,0.854389,0.813158,0.045700,0.016656,0.746976,0.826012,0.433243,0.343070,0.204665,0.477987,0.372456,0.931259
40,0.282374,0.304665,0.586374,0.702376,0.876190,0.902989,0.009312,0.682786,0.017978,0.435482,0.993274,0.161514,0.278928,0.317271,0.571407,0.484798,0.483493,0.981915,0.387233,0.998476
41,0.377149,0.314435,0.372268,0.674016,0.385436,0.444745,0.472007,0.548132,0.700849,0.827505,0.428077,0.787699,0.500066,0.753763,0.703855,0.491042,0.278042,0.458269,0.760095,0.212606
42,0.406204,0.026492,0.611271,0.206561,0.790851,0.240075,0.778168,0.043234,0.355505,0.119484,0.892438,0.393300,0.691879,0.293915,0.884709,0.181975,0.618501,0.519019,0.570551,0.964888
43,0.285322,0.436487,0.817387,0.494203,0.252159,0.400441,0.280366,0.261407,0.781050,0.171191,0.495471,0.972218,0.302469,0.534515,0.064438,0.295743,0.206537,0.921015,0.250549,0.874563
44,0.113588,0.631179,0.888031,0.699872,0.917829,0.308251,0.131613,0.106666,0.051836,0.720883,0.004991,0.740765,0.449756,0.643300,0.860585,0.891017,0.812544,0.273221,0.100748,0.598441
45,0.199978,0.959736,0.720791,0.416459,0.830825,0.884431,0.562199,0.729792,0.011539,0.183246,0.437804,0.944476,0.082517,0.999051,0.091572,0.870569,0.140745,0.388881,0.969811,0.742813
46,0.788572,0.719608,0.396646,0.559529,0.622238,0.238638,0.538872,0.953321,0.555373,0.376173,0.270105,0.476660,0.511388,0.941683,0.804823,0.211268,0.887961,0.337381,0.024123,0.950075
47,0.029421,0.202214,0.832896,0.708642,0.135544,0.110409,0.835485,0.067774,0.228623,0.389880,0.762189,0.252840,0.716289,0.276823,0.394693,0.775223,0.339315,0.883343,0.581372,0.519652
48,0.495309,0.811385,0.886205,0.762942,0.829238,0.996530,0.271748,0.245699,0.174232,0.722346,0.280394,0.807702,0.068659,0.285254,0.998505,0.041221,0.305693,0.335178,0.022417,0.382077
49,0.502743,0.809249,0.536881,0.940268,0.301634,0.381695,0.792779,0.589099,0.368359,0.823407,0.341601,0.491069,0.197482,0.068543,0.640032,0.986826,0.126517,0.949664,0.261863,0.918089

In [13]:
df

    Name Age
0  Uzair  20
1  Abbas  19
2  Lahad  21
3   Razi  22
4  Bilal  19

In [14]:
# how to rename column names
df=pd.DataFrame({'A col ':[1,2,3,4,5],'B col ': [20,19,18,17,16]})

In [15]:
df.rename(columns={'A col': 'a col','B col':'b col'}, inplace=True)

In [16]:
df

   A col   B col
0       1      20
1       2      19
2       3      18
3       4      17
4       5      16

In [17]:
df.columns=['aa_col','bb_col']

In [18]:
df

   aa_col  bb_col
0       1      20
1       2      19
2       3      18
3       4      17
4       5      16

In [19]:
# to replace any character, string, lateral
df.columns=df.columns.str.replace('_',' ')

In [20]:
df

   aa col  bb col
0       1      20
1       2      19
2       3      18
3       4      17
4       5      16

In [21]:
# adding prefix
df.add_prefix('UHS_')

   UHS_aa col  UHS_bb col
0           1          20
1           2          19
2           3          18
3           4          17
4           5          16

In [22]:
# adding suffix
df.add_suffix('_UHS')

   aa col_UHS  bb col_UHS
0           1          20
1           2          19
2           3          18
3           4          17
4           5          16

# 4 using template data

In [23]:
import pandas as pd
import numpy as np
import seaborn as sns

kashti = sns.load_dataset('titanic')
kashti.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [24]:
#  summary
kashti.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [25]:
# cloumns names
kashti.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [26]:
# saving a template dataset

kashti.to_csv('kashti.csv')

In [27]:
# saving to excel
kashti.to_excel('kashti.xlsx')

In [28]:
# viewing csv file
kashti=pd.read_csv('kashti.csv')
kashti

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [29]:
# reading excel file
kashti=pd.read_excel('kashti.xlsx')
kashti

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [30]:
# to text file
kashti.to_csv('kashti.txt',sep='\t')

In [31]:
#  reading text file
kashti=pd.read_csv('kashti.txt',sep='\t')
kashti

,Unnamed: 0.1,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,4,4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,887,887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,888,888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,889,889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,890,890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

# 5 using your own data

In [32]:
import pandas as pd
df = pd.read_csv('database.csv')
df

,Date,Time,Latitude,Longitude,Type,Depth,Depth Error,Depth Seismic Stations,Magnitude,Magnitude Type,...,Magnitude Seismic Stations,Azimuthal Gap,Horizontal Distance,Horizontal Error,Root Mean Square,ID,Source,Location Source,Magnitude Source,Status
0,01/02/1965,13:44:18,19.2460,145.6160,Earthquake,131.60,NaN,NaN,6.0,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860706,ISCGEM,ISCGEM,ISCGEM,Automatic
1,01/04/1965,11:29:49,1.8630,127.3520,Earthquake,80.00,NaN,NaN,5.8,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860737,ISCGEM,ISCGEM,ISCGEM,Automatic
2,01/05/1965,18:05:58,-20.5790,-173.9720,Earthquake,20.00,NaN,NaN,6.2,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860762,ISCGEM,ISCGEM,ISCGEM,Automatic
3,01/08/1965,18:49:43,-59.0760,-23.5570,Earthquake,15.00,NaN,NaN,5.8,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860856,ISCGEM,ISCGEM,ISCGEM,Automatic
4,01/09/1965,13:32:50,11.9380,126.4270,Earthquake,15.00,NaN,NaN,5.8,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860890,ISCGEM,ISCGEM,ISCGEM,Automatic
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
23407,12/28/2016,08:22:12,38.3917,-118.8941,Earthquake,12.30,1.2,40.0,5.6,ML,...,18.0,42.47,0.120,NaN,0.1898,NN00570710,NN,NN,NN,Reviewed
23408,12/28/2016,09:13:47,38.3777,-118.8957,Earthquake,8.80,2.0,33.0,5.5,ML,...,18.0,48.58,0.129,NaN,0.2187,NN00570744,NN,NN,NN,Reviewed
23409,12/28/2016,12:38:51,36.9179,140.4262,Earthquake,10.00,1.8,NaN,5.9,MWW,...,NaN,91.00,0.992,4.8,1.5200,US10007NAF,US,US,US,Reviewed
23410,12/29/2016,22:30:19,-9.0283,118.6639,Earthquake,79.00,1.8,NaN,6.3,MWW,...,NaN,26.00,3.553,6.0,1.4300,US10007NL0,US,US,US,Reviewed
23411,12/30/2016,20:08:28,37.3973,141.4103,Earthquake,11.94,2.2,NaN,5.5,MB,...,428.0,97.00,0.681,4.5,0.9100,US10007NTD,US,US,US,Reviewed

In [33]:
df.head()

,Date,Time,Latitude,Longitude,Type,Depth,Depth Error,Depth Seismic Stations,Magnitude,Magnitude Type,...,Magnitude Seismic Stations,Azimuthal Gap,Horizontal Distance,Horizontal Error,Root Mean Square,ID,Source,Location Source,Magnitude Source,Status
0,01/02/1965,13:44:18,19.246,145.616,Earthquake,131.6,NaN,NaN,6.0,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860706,ISCGEM,ISCGEM,ISCGEM,Automatic
1,01/04/1965,11:29:49,1.863,127.352,Earthquake,80.0,NaN,NaN,5.8,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860737,ISCGEM,ISCGEM,ISCGEM,Automatic
2,01/05/1965,18:05:58,-20.579,-173.972,Earthquake,20.0,NaN,NaN,6.2,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860762,ISCGEM,ISCGEM,ISCGEM,Automatic
3,01/08/1965,18:49:43,-59.076,-23.557,Earthquake,15.0,NaN,NaN,5.8,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860856,ISCGEM,ISCGEM,ISCGEM,Automatic
4,01/09/1965,13:32:50,11.938,126.427,Earthquake,15.0,NaN,NaN,5.8,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860890,ISCGEM,ISCGEM,ISCGEM,Automatic

# 6 reverse row order

In [34]:
import pandas as pd
import seaborn as sns

df=sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [35]:
df.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [36]:
# to check in descending order
df.loc[::-1].head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True

In [37]:
df.loc[::-1].reset_index(drop=True).head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True
1,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
2,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
3,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
4,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True

# 7- reverse colun order

In [38]:
df.loc[:,::-1].head()

,alone,alive,embark_town,deck,adult_male,who,class,embarked,fare,parch,sibsp,age,sex,pclass,survived
0,False,no,Southampton,NaN,True,man,Third,S,7.2500,0,1,22.0,male,3,0
1,False,yes,Cherbourg,C,False,woman,First,C,71.2833,0,1,38.0,female,1,1
2,True,yes,Southampton,NaN,False,woman,Third,S,7.9250,0,0,26.0,female,3,1
3,False,yes,Southampton,C,False,woman,First,S,53.1000,0,1,35.0,female,1,1
4,True,no,Southampton,NaN,True,man,Third,S,8.0500,0,0,35.0,male,3,0

# 8- select a cloumn by a data type

In [39]:
df.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [40]:
# only select those having numeric datatype

df.select_dtypes(include=['number']).head()

   survived  pclass   age  sibsp  parch     fare
0         0       3  22.0      1      0   7.2500
1         1       1  38.0      1      0  71.2833
2         1       3  26.0      0      0   7.9250
3         1       1  35.0      1      0  53.1000
4         0       3  35.0      0      0   8.0500

In [41]:
#  those with float
df.select_dtypes(include=['float']).head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [42]:
#  those with object
df.select_dtypes(include=['object']).head()

      sex embarked    who  embark_town alive
0    male        S    man  Southampton    no
1  female        C  woman    Cherbourg   yes
2  female        S  woman  Southampton   yes
3  female        S  woman  Southampton   yes
4    male        S    man  Southampton    no

In [43]:
#  those with multiple datatypes
df.select_dtypes(include=['float','number','object']).head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,who,embark_town,alive
0,0,3,male,22.0,1,0,7.2500,S,man,Southampton,no
1,1,1,female,38.0,1,0,71.2833,C,woman,Cherbourg,yes
2,1,3,female,26.0,0,0,7.9250,S,woman,Southampton,yes
3,1,1,female,35.0,1,0,53.1000,S,woman,Southampton,yes
4,0,3,male,35.0,0,0,8.0500,S,man,Southampton,no

In [44]:
df.select_dtypes(exclude=['number']).head()

      sex embarked  class    who  adult_male deck  embark_town alive  alone
0    male        S  Third    man        True  NaN  Southampton    no  False
1  female        C  First  woman       False    C    Cherbourg   yes  False
2  female        S  Third  woman       False  NaN  Southampton   yes   True
3  female        S  First  woman       False    C  Southampton   yes  False
4    male        S  Third    man        True  NaN  Southampton    no   True

# 9- convert numbers into strings

In [45]:
# creating a dataframe
df = pd.DataFrame({'col a' : ['1','2','3','4','5'],
                   'col b':['6','7','8','9','10']})
df

  col a col b
0     1     6
1     2     7
2     3     8
3     4     9
4     5    10

In [46]:
df.dtypes

col a    object
col b    object
dtype: object

In [47]:
# changing datatype to numeric
pd.to_numeric(df['col a'],errors='coerce')
df.dtypes

col a    object
col b    object
dtype: object

In [48]:
#  changing type object to int
df=df.astype({'col a':'int','col b':'object'})

In [49]:
df.dtypes

col a     int32
col b    object
dtype: object

In [50]:
# changing datatype to numeric
df=pd.to_numeric(df['col b'],errors='coerce')

# 10- reduce dataframe size

In [51]:
df=sns.load_dataset('titanic')

In [52]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [55]:
#  checking the memory usage by this dataset in our computer
df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 313.7 KB

In [56]:
# reducing the size by taking a fraction of whole dataset
df.sample(frac=0.1).shape

(89, 15)

In [58]:
#  taking 0.5 fraction of whole dataset
df.sample(frac=0.5).shape

(446, 15)

# 11- copy data from clipboard

In [59]:
# dataset download
import seaborn as sns
import pandas as pd

df=sns.load_dataset('titanic')
df.to_excel('kashti.xlsx')

In [61]:
# read clipboard in python
df=pd.read_clipboard()
df

,3,male,20,0,0.1,8.05,S,Third,man,true,Unnamed: 10,Southampton,no,true.1
0,3,male,39.0,1,5,31.28,S,Third,man,True,NaN,Southampton,no,False
1,3,female,14.0,0,0,7.85,S,Third,child,False,NaN,Southampton,no,True
2,2,female,55.0,0,0,16.00,S,Second,woman,False,NaN,Southampton,yes,True
3,3,male,2.0,4,1,29.13,Q,Third,child,False,NaN,Queenstown,no,False
4,2,male,NaN,0,0,13.00,S,Second,man,True,NaN,Southampton,yes,True